web/src/test/resources/integrationtest/predictionquestions/getPredictionQuestionsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:clinicalprocess:healthcond:srs:GetPredictionQuestionsResponder:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetPredictionQuestionsRequest>
         <urn:diagnos>
            <urn1:code>diagnosis_placeholder</urn1:code>
            <urn1:codeSystem>1.2.752.116.1.1.1.1.3</urn1:codeSystem>
         </urn:diagnos>
      </urn:GetPredictionQuestionsRequest>
   </soapenv:Body>
</soapenv:Envelope>